Revit 2027 API
FabricationItemFolder.GetItemFiles Method
 Gets the item files in this item folder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationItemFile> GetItemFiles()
Public Function GetItemFiles As IList(Of FabricationItemFile)
public:
IList<FabricationItemFile^>^ GetItemFiles()
member GetItemFiles : unit -> IList<FabricationItemFile>
Return Value
IList<FabricationItemFile>
See Also
Reference
FabricationItemFolder Class
Autodesk.Revit.DB Namespace